## Get the Data

Either use the provided .csv file or (optionally) get fresh (the freshest?) data from running an SQL query on StackExchange: 

Follow this link to run the query from [StackExchange](https://data.stackexchange.com/stackoverflow/query/675441/popular-programming-languages-per-over-time-eversql-com) to get your own .csv file

<code>
select dateadd(month, datediff(month, 0, q.CreationDate), 0) m, TagName, count(*)
from PostTags pt
join Posts q on q.Id=pt.PostId
join Tags t on t.Id=pt.TagId
where TagName in ('java','c','c++','python','c#','javascript','assembly','php','perl','ruby','visual basic','swift','r','object-c','scratch','go','swift','delphi')
and q.CreationDate < dateadd(month, datediff(month, 0, getdate()), 0)
group by dateadd(month, datediff(month, 0, q.CreationDate), 0), TagName
order by dateadd(month, datediff(month, 0, q.CreationDate), 0)
</code>

## Import Statements

In [127]:
import pandas as pd

## Data Exploration

**Challenge**: Read the .csv file and store it in a Pandas dataframe

In [131]:
df = pd.read_csv('QueryResults.csv', names=['DATE', 'TAG', 'POSTS'], header=0)

**Challenge**: Examine the first 5 rows and the last 5 rows of the of the dataframe

In [134]:
df.head()

                  DATE       TAG  POSTS
0  2008-07-01 00:00:00        c#      3
1  2008-08-01 00:00:00  assembly      8
2  2008-08-01 00:00:00         c     83
3  2008-08-01 00:00:00        c#    503
4  2008-08-01 00:00:00       c++    164

**Challenge:** Check how many rows and how many columns there are. 
What are the dimensions of the dataframe?

In [137]:
df.shape

(2635, 3)

**Challenge**: Count the number of entries in each column of the dataframe

In [140]:
df.count()

DATE     2635
TAG      2635
POSTS    2635
dtype: int64

**Challenge**: Calculate the total number of post per language.
Which Programming language has had the highest total number of posts of all time?

In [143]:
df.groupby("TAG").sum()

                                                         DATE    POSTS
TAG
assembly    2008-08-01 00:00:002008-09-01 00:00:002008-10-...    44513
c           2008-08-01 00:00:002008-09-01 00:00:002008-10-...   404815
c#          2008-07-01 00:00:002008-08-01 00:00:002008-09-...  1617843
c++         2008-08-01 00:00:002008-09-01 00:00:002008-10-...   808449
delphi      2008-08-01 00:00:002008-09-01 00:00:002008-10-...    52008
go          2009-11-01 00:00:002009-12-01 00:00:002010-01-...    73216
java        2008-08-01 00:00:002008-09-01 00:00:002008-10-...  1918796
javascript  2008-08-01 00:00:002008-09-01 00:00:002008-10-...  2530725
perl        2008-08-01 00:00:002008-09-01 00:00:002008-10-...    68144
php         2008-08-01 00:00:002008-09-01 00:00:002008-10-...  1465727
python      2008-08-01 00:00:002008-09-01 00:00:002008-10-...  2198951
r           2008-09-01 00:00:002008-11-01 00:00:002008-12-...   507110
ruby        2008-08-01 00:00:002008-09-01 00:00:002008-10-...   229117
swift       2009-01-01 00:00:002009-02-01 00:00:002009-03-...   334022

Some languages are older (e.g., C) and other languages are newer (e.g., Swift). The dataset starts in September 2008.

**Challenge**: How many months of data exist per language? Which language had the fewest months with an entry?

In [145]:
df.groupby("TAG").count()

            DATE  POSTS
TAG
assembly     190    190
c            190    190
c#           191    191
c++          190    190
delphi       190    190
go           175    175
java         190    190
javascript   190    190
perl         190    190
php          190    190
python       190    190
r            188    188
ruby         190    190
swift        181    181

## Data Cleaning

Let's fix the date format to make it more readable. We need to use Pandas to change format from a string of "2008-07-01 00:00:00" to a datetime object with the format of "2008-07-01"

In [147]:
df.DATE[1]

'2008-08-01 00:00:00'

In [149]:
df.DATE = pd.to_datetime(df.DATE)

In [151]:
df.head()

        DATE       TAG  POSTS
0 2008-07-01        c#      3
1 2008-08-01  assembly      8
2 2008-08-01         c     83
3 2008-08-01        c#    503
4 2008-08-01       c++    164

## Data Manipulation

In [153]:
test_df = pd.DataFrame({'Age': ['Young', 'Young', 'Young', 'Young', 'Old', 'Old', 'Old', 'Old'],
                        'Actor': ['Jack', 'Arnold', 'Keanu', 'Sylvester', 'Jack', 'Arnold', 'Keanu', 'Sylvester'],
                        'Power': [100, 80, 25, 50, 99, 75, 5, 30]}
                      )

**Challenge**: What are the dimensions of our new dataframe? How many rows and columns does it have? Print out the column names and print out the first 5 rows of the dataframe.

In [159]:
test_df.head()

     Age      Actor  Power
0  Young       Jack    100
1  Young     Arnold     80
2  Young      Keanu     25
3  Young  Sylvester     50
4    Old       Jack     99

In [157]:
pivoted_df = test_df.pivot(index='Age', columns='Actor', values='Power')
pivoted_df

Actor  Arnold  Jack  Keanu  Sylvester
Age
Old        75    99      5         30
Young      80   100     25         50

**Challenge**: Count the number of entries per programming language. Why might the number of entries be different?

## Data Visualisaton with with Matplotlib

**Challenge**: Use the [matplotlib documentation](https://matplotlib.org/3.2.1/api/_as_gen/matplotlib.pyplot.plot.html#matplotlib.pyplot.plot) to plot a single programming language (e.g., java) on a chart.

**Challenge**: Show two line (e.g. for Java and Python) on the same chart.

# Smoothing out Time Series Data

Time series data can be quite noisy, with a lot of up and down spikes. To better see a trend we can plot an average of, say 6 or 12 observations. This is called the rolling mean. We calculate the average in a window of time and move it forward by one overservation. Pandas has two handy methods already built in to work this out: [rolling()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html) and [mean()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.core.window.rolling.Rolling.mean.html).